Revit 2027 API
ViewSheetFailures Properties
The BuiltInFailures.ViewSheetFailures type exposes the following members.
Properties
Name | Description
ViewInAModelMustBeUnique |  Sheet views in this model cannot contain more than one instance of "%1!s!."
ViewInAModelMustBeUniqueWarn |  Sheet views in this model cannot contain more than one instance of "%1!s!."
ViewOnASheetCannotBeUncropped3DPerspectiveView |  Sheets do not support uncropped perspective views.
ViewOnASheetMustBeUnique |  Sheet views cannot contain more than one instance of "%1!s!."
ViewOnASheetMustBeUniqueWarn |  Sheet views cannot contain more than one instance of "%1!s!."
ViewportCantContainEmptyView |  Sheet views cannot contain empty view "%1!s!".
Top
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace